In [1]:
import pandas as pd

In [7]:
## Series
# A Pandas Series is a one dimensional array like object that can hold any data type. It is similar to a column in a table. 

import pandas as pd 
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
# Create a Series from dictionary 

data = {'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E': 5}
series = pd.Series(data)
print(series)
print(type(series))

A    1
B    2
C    3
D    4
E    5
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
data = [10, 20, 30]
index = ['a', 'b', 'c']
series = pd.Series(data, index = index)
print(series)

a    10
b    20
c    30
dtype: int64

In [9]:
## Dataframe
# Create a Dataframe from a dictionary of list 

data = {
    'Name': ['Sushil', 'Sai', 'Akash'], 
    'Age': [20, 30, 19], 
    'City': ['Bangalore', 'Surat', 'Surat']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0  Sushil   20  Bangalore
1     Sai   30      Surat
2   Akash   19      Surat
<class 'pandas.core.frame.DataFrame'>

In [11]:
import numpy as np 
np.array(df)

array([['Sushil', 20, 'Bangalore'],
       ['Sai', 30, 'Surat'],
       ['Akash', 19, 'Surat']], dtype=object)

In [18]:
## Create a Data Frame a list of dictionary 

data = [
    {'Name': 'Sushil', 'Age': 21, 'City': 'Bangalore'}, 
    {'Name': 'Akash', 'Age':  25, 'City': 'Surat'}, 
    {'Name': 'Sai', 'Age': 30, 'City': 'Surat'}
]
series = pd.DataFrame(data)
print(series)

     Name  Age       City
0  Sushil   21  Bangalore
1   Akash   25      Surat
2     Sai   30      Surat

In [79]:
df = pd.read_csv('Datasets/Details.csv')
df.head(5)

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

In [25]:
df.tail()

     Order ID  Amount  Profit  Quantity     Category Sub-Category PaymentMode
1495  B-25700       7      -3         2     Clothing  Hankerchief         COD
1496  B-25757    3151     -35         7     Clothing     Trousers         EMI
1497  B-25973    4141    1698        13  Electronics     Printers         COD
1498  B-25698       7      -2         1     Clothing  Hankerchief         COD
1499  B-25993    4363     305         5    Furniture       Tables         EMI

In [29]:
## Accessing Data from Dataframe
df

     Name  Age       City
0  Sushil   20  Bangalore
1     Sai   30      Surat
2   Akash   19      Surat

In [35]:
df['Name']

0    Sushil
1       Sai
2     Akash
Name: Name, dtype: object

In [36]:
df.loc[0]

Name       Sushil
Age            20
City    Bangalore
Name: 0, dtype: object

In [38]:
df.iloc[0]

Name       Sushil
Age            20
City    Bangalore
Name: 0, dtype: object

In [42]:
df.loc[0][1]

C:\Users\admin\AppData\Local\Temp\ipykernel_22504\395987507.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][1]

20

In [45]:
## Accessing specified element 
df.at[1,'Age']

30

In [46]:
## Accessing specified element using iat
df.iat[2,2]

'Surat'

In [52]:
## Data Manipulation with Dataframe
df

     Name  Age       City
0  Sushil   20  Bangalore
1     Sai   30      Surat
2   Akash   19      Surat

In [61]:
# Adding a column
df['Salary'] = [6000000, 400000, 300000]
df

     Name  Age       City   Salary
0  Sushil   20  Bangalore  6000000
1     Sai   30      Surat   400000
2   Akash   19      Surat   300000

In [64]:
# Remove a column 
df.drop('Salary', axis = 1, inplace = True)

In [65]:
df

     Name  Age       City
0  Sushil   20  Bangalore
1     Sai   30      Surat
2   Akash   19      Surat

In [75]:
## Add age to the column
df['Age'] = df['Age']+1

In [76]:
df

     Name  Age       City
0  Sushil   21  Bangalore
1     Sai   31      Surat
2   Akash   20      Surat

In [77]:
df.drop(1, inplace= True)

In [78]:
df

     Name  Age       City
0  Sushil   21  Bangalore
2   Akash   20      Surat

In [80]:
df

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card
...,...,...,...,...,...,...,...
1495,B-25700,7,-3,2,Clothing,Hankerchief,COD
1496,B-25757,3151,-35,7,Clothing,Trousers,EMI
1497,B-25973,4141,1698,13,Electronics,Printers,COD
1498,B-25698,7,-2,1,Clothing,Hankerchief,COD
1499,B-25993,4363,305,5,Furniture,Tables,EMI

In [10]:
## Display the data types of each coulmn 
print("Data types:\n", df.dtypes)

Data types:
 Name    object
Age      int64
City    object
dtype: object

In [11]:
# Describe the DataFrame 
print("Statistical summary:\n", df.describe())

Statistical summary:
              Age
count   3.000000
mean   23.000000
std     6.082763
min    19.000000
25%    19.500000
50%    20.000000
75%    25.000000
max    30.000000